InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКассККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКассККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтономнаяККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМED</Name>
					<Comment>ККМ из другой программы, участвующая в обмене через EnterpriseData</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСтруктурнойЕдиницы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтруктурныхЕдиниц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрдерныйСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ</Name>
					<Comment>Подпись материально-ответственного лица</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничныйВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаВРознице</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНаценки</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОтходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяОтходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаОрдерныхСкладов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаОрдерныхСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПеремещении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПоступлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетОстатковПоЯчейкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладУправляющейСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦенСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтролироватьАссортимент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПользователей/Forms/ФормаНастройкиПользователя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	НастройкиПоОрганизации.ЗагрузитьЗначения(ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям());

	Если Параметры.Свойство("СтрокаПоиска") Тогда
		ВведеннаяСтрокаПоиска = Параметры.СтрокаПоиска;
		СтрокаПоиска = Параметры.СтрокаПоиска;
	Иначе
		СтрокаПоиска = Неопределено;
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;		
		
	Если ЗначениеЗаполнено(Пользователь) Тогда
		
		ЗаполнитьДерево(СтрокаПоиска);
		
		Если ИспользоватьНесколькоОрганизаций Тогда
			ЗаполнитьДеревоПоОрганизациям(СтрокаПоиска);
			Элементы.ГруппаОрганизации.Видимость = Истина;
		Иначе
			Элементы.ГруппаОбщие.ОтображатьЗаголовок = Ложь;
			Элементы.ГруппаОрганизации.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии() 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено ИЛИ Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		
		Отказ = Истина;
		Возврат;
		
	ИначеЕсли Элемент.ТекущиеДанные.Настройка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделение") Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", 
			ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Подразделение")));
		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);;
		
	ИначеЕсли Элемент.ТекущиеДанные.Настройка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойСклад") Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Розница"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", Новый ФиксированныйМассив(НовыйМассив));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	ИначеЕсли Элемент.ТекущиеДанные.Настройка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаСкладов") Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", 
			ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов")));
		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	ИначеЕсли Элемент.ТекущиеДанные.Настройка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.НоменклатураДоставки") Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", 
			ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")));
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ЭтоНабор", Ложь));
		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Настройка) Тогда
		Если ТекущиеДанные.Настройка = 
			ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаСкладов") Тогда
			
			СтандартнаяОбработка = Ложь;
			
			СтруктураОтбора = Новый Структура("ТипСтруктурнойЕдиницы", 
				ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов"));
			
			ПараметрыОткрытия = Новый Структура("Отбор, РежимВыбора", СтруктураОтбора, Истина);
			ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора",ПараметрыОткрытия, Элемент, , , , ,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
		
		Если ТекущиеДанные.Настройка = 
			ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяКассаККМ") Тогда
			
			СтандартнаяОбработка = Ложь;
			
			СтруктураОтбора = Новый Структура("ТипКассы", 
				ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ФискальныйРегистратор"));
			
			ПараметрыОткрытия = Новый Структура("Отбор, РежимВыбора", СтруктураОтбора, Истина);
			ОткрытьФорму("Справочник.КассыККМ.ФормаВыбора",ПараметрыОткрытия, Элемент, , , , ,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Настройка) Тогда	
		
		Если НастройкиПоОрганизации.НайтиПоЗначению(ТекущиеДанные.Настройка) <> Неопределено Тогда
			ТекущиеДанные.Организация = Организация;
		КонецЕсли;
		
		Если ТекущиеДанные.Настройка =
			ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.СбрасыватьКоличествоПриИзмененииНоменклатуры") Тогда
			
			ЗаписатьСтатистикуНастройки("РегистрСведений.НастройкиПользователей.СбрасыватьКоличествоПриИзмененииНоменклатуры.",
				ТекущиеДанные.Значение)
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПоОрганизацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНастроекПоОрганизации.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Настройка) Тогда	
		
		Если НастройкиПоОрганизации.НайтиПоЗначению(ТекущиеДанные.Настройка) <> Неопределено Тогда
			ТекущиеДанные.Организация = Организация;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОбновитьНастройки();
	ЗаполнитьДеревоПоОрганизациям();
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоНастроекПоОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ВведеннаяСтрокаПоискаПриИзменении(Элемент)
	
	СтрокаПоиска = ВведеннаяСтрокаПоиска;
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		СтрокаПоиска = Неопределено;
	КонецЕсли;
		
	ЗаполнитьДеревьяНастроек(СтрокаПоиска);
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоНастроек");
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоНастроекПоОрганизации");	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревьяНастроек(СтрокаПоиска = Неопределено)
	
	ЗаполнитьДерево(СтрокаПоиска);
	
	Если ИспользоватьНесколькоОрганизаций Тогда
		
		ЗаполнитьДеревоПоОрганизациям(СтрокаПоиска);
		Элементы.ГруппаОрганизации.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаОрганизации.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет информацию в таблице настроек.
//
&НаСервере
Процедура ЗаполнитьДерево(СтрокаПоиска = Неопределено)

	НастройкиЭлементы = ДеревоНастроек.ПолучитьЭлементы();
	НастройкиЭлементы.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкиПоОрганизации", НастройкиПоОрганизации);
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Настройки.Родитель КАК Родитель,
	|	Настройки.Ссылка КАК Настройка,
	|	Настройки.ЭтоГруппа КАК ЭтоГруппа,
	|	НЕ Настройки.ЭтоГруппа КАК НомерКартинки,
	|	ЗначениеНастроек.Значение КАК Значение,
	|   ЕСТЬNULL(ЗначениеНастроек.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,	
	|	Константы.ИспользоватьНесколькоОрганизаций КАК ИспользоватьНесколькоОрганизаций,
	|	Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам КАК ФункциональнаяОпцияУчетПоНесколькимСкладам,
	|	Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям КАК ФункциональнаяОпцияУчетПоНесколькимПодразделениям
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
	|		ПО (ЗначениеНастроек.Настройка = Настройки.Ссылка)
	|			И (ЗначениеНастроек.Пользователь = &Пользователь),
	|	Константы КАК Константы
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|   %ПоГруппам%
	|	И НЕ(Константы.ИспользоватьНесколькоОрганизаций И Настройки.Ссылка В (&НастройкиПоОрганизации))
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация)
	|				И НЕ Константы.ИспользоватьНесколькоОрганизаций)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнойСклад)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделение)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьЗарплатаИсполнителейВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьЗарплатаИсполнителейВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьМатериалыВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьМатериалыЗаказчикаВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьТоварыВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеВидаРаботВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаДоступаЛидов)
	|				И НЕ Константы.ИспользоватьПодсистемуCRM)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнойКалендарь)
	|				И НЕ Константы.ИспользоватьКалендариСотрудников)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеПроекта)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоПроектам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеВидаРаботВЗаданииНаРаботу)
	|				И НЕ Константы.ИспользоватьЗаданияНаРаботу)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЗаказаНаПроизводствоВДокументахОтгрузки)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЗаказаПокупателяВДокументахПроизводства)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСкладаВДокументахПроизводства)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство) 
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.РасчетКалькуляцииПоДаннымТЧВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеНастроекНалоговогоУчетаВБанковскихДокументах)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьОтчетность)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов)
	|				И НЕ Константы.ФункциональнаяУчетВалютныхОпераций)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВесВЗаказеНаПеремещение)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВесВЗаказеПоставщику)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВесВПеремещенииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВесВСписанииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуВесВСчетеНаОплату)
	|				И НЕ Константы.ИспользоватьСчетаНаОплату)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуНоменклатураПоставщикаВЗаказеПоставщику)
	|				И НЕ Константы.ФункциональнаяОпцияУчетНоменклатурыПоставщиков)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуНоменклатураПоставщикаВПриходнойНакладной)
	|				И НЕ Константы.ФункциональнаяОпцияУчетНоменклатурыПоставщиков)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуНоменклатураПоставщикаВРасходнойНакладной)
	|				И НЕ Константы.ФункциональнаяОпцияУчетНоменклатурыПоставщиков)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуНоменклатураПоставщикаВСчетеНаОплатуПоставщика)
	|				И НЕ Константы.ФункциональнаяОпцияУчетНоменклатурыПоставщиков)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуОбъемВЗаказеНаПеремещение)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуОбъемВЗаказеПоставщику)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуОбъемВПеремещенииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуОбъемВСписанииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуОбъемВСчетеНаОплату)
	|				И НЕ Константы.ИспользоватьСчетаНаОплату)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеЗапасы)
	|				И НЕ Константы.ИспользоватьАвансовыеОтчеты)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАвансовомОтчетеРасходы)
	|				И НЕ Константы.ИспользоватьАвансовыеОтчеты)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАктеВыполненныхРабот)
	|				И НЕ Константы.ИспользоватьАктыВыполненныхРабот)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАктеОРасхожденияхЗапасы)
	|				И НЕ Константы.ИспользоватьКорректировкиПоступлений)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАктеОРасхожденияхРасходы)
	|				И НЕ Константы.ИспользоватьКорректировкиПоступлений)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВАктеОРасхожденияхПолученном)
	|				И НЕ Константы.ИспользоватьКорректировкиРеализаций)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВДополнительныхРасходахРасходы)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВЗаказеПокупателяРаботы)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВЗаказеПокупателяЗапасы)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВЗаказеПоставщику)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВКорректировкеПоступленияЗапасы)
	|				И НЕ Константы.ИспользоватьКорректировкиПоступлений)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВКорректировкеПоступленияРасходы)
	|				И НЕ Константы.ИспользоватьКорректировкиПоступлений)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВКорректировкеРеализации)
	|				И НЕ Константы.ИспользоватьКорректировкиРеализаций)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВПередачеТоваровМеждуОрганизациями)
	|				И НЕ Константы.ПередачаТоваровМеждуОрганизациями)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВПриходнойНакладнойЗапасы)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВПриходнойНакладнойРасходы)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВСчетеНаОплату)
	|				И НЕ Константы.ИспользоватьСчетаНаОплату)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСодержаниеВСчетеНаОплатуПолученном)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуСуммаВСписанииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуЦенаВСписанииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуАртикулВНоменклатуреУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуАртикулВХарактеристикахУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуКодВНоменклатуреУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуКодВХарактеристикахУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуШтрихкодВНоменклатуреУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьКолонкуШтрихкодВХарактеристикахУстановкиЦен)
	|				И НЕ Константы.ИспользоватьУстановкуЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьПредпросмотрЗаказНарядов)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнойРежимРаботыСОплатой)
	|				И НЕ Константы.ИспользоватьПодсистемуДеньги)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьМобильнуюТелефонию)
	|				И НЕ Константы.ИспользоватьПодсистемуCRM)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.УСНПроизводствоПоУмолчанию)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗаполнятьПринятоОтТекущимПользователем)
	|				И НЕ Константы.ИспользоватьПодсистемуДеньги)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗачитыватьАвансыДолгиАвтоматически)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьЗарплатаИсполнителейВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьМатериалыВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьМатериалыЗаказчикаВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьТоварыВЗаказНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаДоступаКонтрагентов)
	|				И НЕ Константы.ИспользоватьГруппыДоступаКонтрагентов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаДоступаЛидов)
	|				И НЕ Константы.ИспользоватьГруппыДоступаЛидов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяКасса)
	|				И НЕ Константы.ИспользоватьКассы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяКассаККМ)
	|				И НЕ Константы.ФункциональнаяОпцияУчетРозничныхПродаж)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаСкладов)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеДатыПоступленияВЗаказеПокупателя)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеДатыПоступленияВЗаказеПоставщику)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеДокументаПоступления)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьОрдерныйСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЗаказаПокупателяВДокументахПоступления)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЗаказаПокупателяВПеремещенииЗапасов)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЗаказаПоставщикуВДокументахПоступления)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеИсполнитель)
	|				И НЕ Константы.ФункциональнаяОпцияУчетРозничныхПродаж)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеИсполнителяВСдельномНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьТехоперации)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеОтветственный)
	|				И НЕ Константы.ФункциональнаяОпцияУчетРозничныхПродаж)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеПодразделенияВДенежныхДокументах)
	|				И НЕ Константы.ИспользоватьСтруктурныеЕдиницы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСтруктурнойЕдиницыВСдельномНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьТехоперации)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеРасходовВОтчетеПереработчика)
	|				И НЕ Константы.ФункциональнаяОпцияПередачаСырьяВПереработку)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСкладаВДокументахОтгрузки)
	|				И НЕ Константы.ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСкладаВДокументахПоступления)
	|				И НЕ Константы.ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСтатьи)
	|				И НЕ Константы.ИспользоватьПодсистемуДеньги)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСчетФактурыНаФорме)
	|				И НЕ Константы.ИспользоватьАвансовыеОтчеты)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЭквайринговогоТерминалаВБанковскихДокументах)
	|				И НЕ Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЯчейкиВКомплектацииЗапасов)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоЯчейкам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЯчейки)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоЯчейкам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЯчейкиОтправителя)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоЯчейкам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеЯчейкиПолучателя)
	|				И НЕ Константы.ФункциональнаяОпцияУчетПоЯчейкам)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПроверятьРасхожденияСВходящимДокументом)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПроверятьРасхожденияСЗаказом)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗаполнятьКолонкуРезервПриДобавленииВКорзину)
	|				И НЕ Константы.ФункциональнаяОпцияРезервированиеЗапасов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнойВидЦенПродажи)
	|				И НЕ Константы.ИспользоватьВидыЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОткрыватьПрайсЛистОрганизацииКакСписок)
	|				И НЕ Константы.ИспользоватьВидыЦен)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.РабочийПрайсЛистКонтрагентов)
	|				И НЕ Константы.ФункциональнаяОпцияУчетЦенКонтрагентов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОткрыватьПрайсЛистКонтрагентовКакСписок)
	|				И НЕ Константы.ФункциональнаяОпцияУчетЦенКонтрагентов)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВариантОбработкиКодаМаркировкиВДокументахПоступления)
	|				И НЕ Константы.ИспользоватьПодсистемуЗакупки)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.РежимВыполнениеЭтапов)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьЭтапыПроизводства)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПодписьКассира)
	|				И НЕ Константы.ИспользоватьКассы)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПодписьМОЛ)
	|				И НЕ Константы.ИспользоватьПодсистемуСклад)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПодписьСтаршегоКассира)
	|				И НЕ Константы.ИспользоватьКассы)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.СпособЗагрузкиДанныхИзВнешнихИсточников)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗагрузкаДанныхИзВнешнихИсточников)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗначениеЗаполненияКатегорияНоменклатуры)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.УдалитьБиллинг)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.УдалитьОпросПоПодсистемеБиллингЗавершен)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьСоветОплатаСертификатомВВалюте)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПредложениеИспользованияСистемыВзаимодействияДляТелефонииПоказано)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеИсполнителяВСдельномНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьТехоперации)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоложениеСтруктурнойЕдиницыВСдельномНаряде)
	|				И НЕ Константы.ФункциональнаяОпцияИспользоватьТехоперации)
	|	И НЕ(Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.НеВыводитьОтчетыПоПродажамИЦенамВКарточкеНоменклатуры))
	
	//::: ПОДБОР
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьСоветВернутьсяКНоменклатуре)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьСоветИспользоватьПредыдущийПодбор)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьСоветУслугиВПриходныхДокументах)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ГруппаОтбора)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗапоминатьТекущуюИерархию)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗапрашиватьКоличество)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗапрашиватьКоличествоИЦену)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗапрашиватьЦену)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнойВидОтбора)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьОстатки)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьРезерв)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьСвободныйОстаток)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПоказыватьЦены)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.СпособВыводаОстатков)
	
	//::: ЦЕНЫ
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьВопросСозданииПервогоПрайсЛистаКонтрагента)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ВыводитьВопросСозданииПервогоПрайсЛистаОрганизации)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.УдалитьАвтоматическиФормироватьОбновлятьПрайсЛист)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.УдалитьОсновнаяФормаПрайсЛиста)
	|	И НЕ Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ЗакрытьПомощникБезПодтверждения)	
	
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа ИЕРАРХИЯ,
	|	Настройки.Наименование";
	
	Если СтрокаПоиска = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоГруппам%", "");
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоГруппам%", "И НЕ Настройки.ЭтоГруппа");
		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	ДобавитьСтрокиВДерево(Выборка, НастройкиЭлементы, СтрокаПоиска);
	
КонецПроцедуры // ЗаполнитьДерево()

// Процедура обновляет информацию в таблице настроек по организации.
//
&НаСервере
Процедура ЗаполнитьДеревоПоОрганизациям(СтрокаПоиска = Неопределено)
	
	НастройкиЭлементы = ДеревоНастроекПоОрганизации.ПолучитьЭлементы();
	НастройкиЭлементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкиПоОрганизации", НастройкиПоОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Родитель КАК Родитель,
	|	Настройки.Ссылка КАК Настройка,
	|	Настройки.ЭтоГруппа КАК ЭтоГруппа,
	|	НЕ Настройки.ЭтоГруппа КАК НомерКартинки,
	|	ЗначениеНастроек.Значение КАК Значение,
	|   ЕСТЬNULL(ЗначениеНастроек.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
	|		ПО (ЗначениеНастроек.Настройка = Настройки.Ссылка)
	|			И (ЗначениеНастроек.Пользователь = &Пользователь)
	|			И (ЗначениеНастроек.Организация = &Организация)
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|   И Настройки.Ссылка В (&НастройкиПоОрганизации)
	|   %ПоГруппам%
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа ИЕРАРХИЯ,
	|	Настройки.Наименование";
	
	Если СтрокаПоиска = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоГруппам%", "");
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоГруппам%", "И НЕ Настройки.ЭтоГруппа");
		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	ДобавитьСтрокиВДерево(Выборка, НастройкиЭлементы, СтрокаПоиска);
	
КонецПроцедуры // ЗаполнитьДеревоПоОрганизациям()

// По переданным данным создаем дерево строк на форме
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - выборка запроса с данными в иерархии
//  Дерево - ДанныеФормыКоллекцияЭлементовДерева - элементы дерева значения, для которого создаются строки
//  СтрокаПоиска - Строка
//
&НаСервере
Процедура ДобавитьСтрокиВДерево(Выборка, Дерево, СтрокаПоиска = Неопределено)
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиВыборки = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если СтрокаПоиска <> Неопределено И СтрНайти(НРег(Выборка.Настройка.Наименование), НРег(СтрокаПоиска)) = 0
			И СтрокиВыборки.Количество() = 0 Тогда
				Продолжить;
		КонецЕсли;
		
		НоваяСтрокаНастройки = Дерево.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНастройки, Выборка);
		НоваяСтрокаНастройки.Значение = Выборка.Настройка.ТипЗначения.ПривестиЗначение(Выборка.Значение);
		
		Если СтрокиВыборки.Количество() > 0 Тогда
			
			ДобавитьСтрокиВДерево(СтрокиВыборки, НоваяСтрокаНастройки.ПолучитьЭлементы(), СтрокаПоиска);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет запись значений настроек в регистр сведений.
//
&НаСервере
Процедура ОбновитьНастройки()
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь, Истина);
	НаборЗаписей.Прочитать();
	
	ЗаписиНабора = НаборЗаписей.Выгрузить();
	
	НастройкиГруппы = ДеревоНастроек.ПолучитьЭлементы();
	ОбновитьЗаписиПоДереву(ДеревоНастроек.ПолучитьЭлементы(), ЗаписиНабора);
	
	Если ИспользоватьНесколькоОрганизаций Тогда
		ОбновитьЗаписиПоДереву(ДеревоНастроекПоОрганизации.ПолучитьЭлементы(), ЗаписиНабора);
	КонецЕсли;

	НаборЗаписей.Загрузить(ЗаписиНабора);
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // ОбновитьНастройки()

&НаСервере
Процедура ОбновитьЗаписиПоДереву(НастройкиГруппы, ЗаписиНабора)
	
	Для Каждого ГруппаНастроек Из НастройкиГруппы Цикл
		
		Если НЕ ГруппаНастроек.Настройка.ЭтоГруппа Тогда
			ЗаполнитьНастройкуПоСтроке(ГруппаНастроек, ЗаписиНабора);
		Иначе		
			НастройкиЭлементы = ГруппаНастроек.ПолучитьЭлементы();
			
			Для Каждого СтрокаНастроек Из НастройкиЭлементы Цикл
				ЗаполнитьНастройкуПоСтроке(СтрокаНастроек, ЗаписиНабора);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуПоСтроке(СтрокаНастроек, ЗаписиНабора)
	
	Отбор = Новый Структура("Настройка, Организация", СтрокаНастроек.Настройка, СтрокаНастроек.Организация);
	ЗаписиНастроекПользователя = ЗаписиНабора.НайтиСтроки(Отбор);
	
	Если ЗаписиНастроекПользователя.Количество() = 0 Тогда
		
		ЗаписьОНастройкеПользователя = ЗаписиНабора.Добавить();
		ЗаписьОНастройкеПользователя.Пользователь = Пользователь;
		ЗаписьОНастройкеПользователя.Настройка = СтрокаНастроек.Настройка;				
		ЗаписьОНастройкеПользователя.Организация = СтрокаНастроек.Организация;
		
	Иначе
		
		ЗаписьОНастройкеПользователя = ЗаписиНастроекПользователя[0];
		
	КонецЕсли;
	
	ЗаписьОНастройкеПользователя.Значение = 
		СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастроек.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтатистикуНастройки(Настройка, ЗначениеНастройки)
	
	Если НЕ ПустаяСтрока(ЗначениеНастройки) Тогда
		Значение = СтрЗаменить(ЗначениеНастройки, " ", "")
	Иначе
		Значение = "НеНастроено";
	КонецЕсли;
		
	ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(Настройка + Значение, 1);

КонецПроцедуры

#КонецОбласти
